{
  "id": "datalist_element",
  "title": "datalist element",
  "type": "element",
  "description": "The datalist element represents a set of option elements that represent predefined options for other controls. It is attached to an input via the list attribute.",
  "references": [
    {
      "title": "WHATWG HTML5 spec for datalist",
      "url": "https://html.spec.whatwg.org/#the-datalist-element"
    },
    {
      "title": "HTML AAM for the datalist element",
      "url": "https://www.w3.org/TR/html-aam-1.0/#details-id-25"
    }
  ],
  "assertions": [
    {
      "id": "convey_role",
      "title": "convey the datalist role (listbox)",
      "rationale": "The user needs to know that the element has listbox behavior.",
      "examples": [
        "A screen reader might announce something like the \"datalist\", \"listbox\" role when entering the datalist. Note that it should not be conveyed as a menu per the AAM mappings.",
        "A screen reader might not announce the datalist role because it is implied by the presence of suggestions or auto complete functionality via the list attribute.",
        "Voice control software might let the user say something like \"show choices\" to open the datalist."
      ],
      "type": "MUST",
      "css_target": "datalist",
      "preconditions": [],
      "operation_modes": [
        "sr/reading",
        "sr/interaction",
        "vc"
      ]
    },
    {
      "id": "convey_boundaries",
      "title": "convey the boundaries of the datalist",
      "rationale": "The user needs to know when they enter and exit a datalist",
      "examples": [
        "A screen reader might announce the datalist role when entering the datalist and say something like \"leaving datalist\" when exiting.",
        "A screen reader might not explicitly announce entering and existing the datalist, but instead imply that the user is in a data list by conveying suggestion or option roles.",
        "A screen reader might announce position in set information such as \"1 of 6\"."
      ],
      "type": "MUST",
      "css_target": "datalist",
      "preconditions": [],
      "operation_modes": [
        "sr/reading",
        "sr/interaction"
      ]
    },
    {
      "id": "convey_change_in_suggestions",
      "title": "convey that changes in suggestions were made",
      "rationale": "The user needs to know that the list of suggestions changed",
      "examples": [
        "A screen reader might announce the word \"suggestions\" whenever the list of suggestions changes.",
        "A screen reader might announce the value of every suggestion when the list of suggestions changes."
      ],
      "type": "MUST",
      "css_target": "datalist",
      "preconditions": [],
      "operation_modes": [
        "sr/reading",
        "sr/interaction"
      ]
    }
  ],
  "date_updated": "2019-07-19"
}
