{
  "id": "input[type=date]_element",
  "title": "input[type=\"date\"] element",
  "type": "element",
  "description": "",
  "is_form_control": true,
  "references": [
    {
      "title": "HTML5 spec for input[type=\"date\"]",
      "url": "https://html.spec.whatwg.org/multipage/input.html#date-state-(type=date)"
    }
  ],
  "assertions": [
    {
      "id": "convey_name",
      "examples":  [
        "A screen reader will announce the name (label).",
        "Voice control software will let the user say something like \"click <name>\" to activate the control."
      ],
      "css_target": "input[type=\"date\"]"
    },
    {
      "id": "convey_role",
      "rationale": "A screen reader user needs to know that they can enter text.",
      "examples": [
        "A screen reader might be announce the role as \"popup button\", \"edit\", \"edit text\", \"date edit\", \"date picker\", etc.",
        "Voice control software will let the user say something like \"click text box\" to focus a the input or flag the role with a number."
      ],
      "css_target": "input[type=\"date\"]"
    },
    {
      "id": "convey_value",
      "css_target": "input[type=\"date\"]"
    },
    {
      "id": "convey_change_in_value",
      "examples": [
        "When the user enter texts, the screen reader will announce it back to them."
      ],
      "css_target": "input[type=\"date\"]"
    },
    {
      "id": "provide_shortcuts",
      "css_target": "input[type=\"date\"]"
    },
    {
      "id": "widget_is_supported",
      "title": "support the date picker widget and native controls",
      "rationale": "Users need to be able to operate the the date picker widget.",
      "notes": "This expectation covers both the date picker widget and the embedded native controls implemented by some browsers. For example, some browsers include multiple tab stops, one each for the day, month, and year, as well as a date picker popup. Because browsers are not consistent with how these controls are implemented, they are lumped into one expectation. This expectation passes if all controls have a name, role, value, and other appropriate semantics passed. Reality check: a user can use all provided controls and successfully enter a date.",
      "strength": {
        "sr": "MUST",
        "vc": "MUST"
      },
      "examples": [
        "If implemented as a text field, this is not applicable",
        "If implemented as a date picker, the screen reader must convey appropriate semantics",
        "If implemented as multiple text inputs (one each for month, day, and year), the screen reader must convey appropriate semantics",
        "Voice control software will let the user activate and fill the appropriate controls"
      ],
      "css_target": "input[type=\"date\"]",
      "operation_modes": [
        "sr/reading",
        "sr/interaction",
        "vc"
      ],
      "exclude_browsers": {"ie":  "no_support"}
    }
  ],
  "date_updated": "2018-10-31"
}
