{
  "id": "ol_element",
  "title": "ol element",
  "type": "element",
  "description": "",
  "related_features": [
    "html/li_element"
  ],
  "references": [
    {
      "title": "WHATWG HTML spec for the ol element",
      "url": "https://html.spec.whatwg.org/multipage/grouping-content.html#the-ol-element"
    },
    {
      "title": "HTML AAM for the ol element",
      "url": "https://w3c.github.io/html-aam/#el-ol"
    }
  ],
  "assertions": [
    {
      "id": "convey_role",
      "strength": {
        "sr": "MUST",
        "vc": "NA"
      },
      "examples": [
        "Typically, the word \"list\" is announced when entering the list, then the number of each item is announced when entering a list item. Together, these two pieces of information convey the unordered list role."
      ],
      "css_target": "ol",
      "operation_modes": [
        "sr/reading",
        "sr/interaction"
      ]
    },
    {
      "id": "convey_boundaries",
      "examples": [
        "In reading mode, there might be a stop for both the start end end of the list. When entering the list, something like \"list of x items\" might announced. When leaving the list, something like \"end of list\" might announced.",
        "In reading mode, there might not be a stop for the start or end of the list. In this case, the screen reader might announce the first item as something like 1 of x, and the last item as x of x, or otherwise announce the the boundaries when entering or exiting the list.",
        "In interaction mode, there will not be a stop for the start or end of the list. In this case, the screen reader might announce the first item as something like \"list of x items\", and the last item as \"x of x\", or \"end of list\", or otherwise announce the the boundaries when entering or exiting the list."
      ],
      "css_target": "ol",
      "operation_modes": [
        "sr/reading",
        "sr/interaction"
      ]
    },
    {
      "id": "convey_setsize",
      "examples": [
        "Typically, the word \"list\" is announced when entering the list. The list item's number is announced when entering a list item. Together, these two pieces of information convey the ordered list role."
      ],
      "css_target": "ol",
      "operation_modes": [
        "sr/reading",
        "sr/interaction"
      ]
    },
    {
      "id": "convey_nesting_level",
      "rationale": "A screen reader user might find it helpful to know what nesting level they are at.",
      "examples": [
        "A screen reader might announce something like \"nesting level x\" when entering a nested list"
      ],
      "css_target": "ol ol"
    }
  ],
  "date_updated": "2019-09-15"
}
