{
  "id": "ul_element",
  "title": "ul element",
  "type": "element",
  "description": "",
  "related_features": [
    "html/li_element"
  ],
  "references": [
    {
      "title": "HTML5 spec for ul",
      "url": "https://w3c.github.io/html/grouping-content.html#the-ul-element"
    }
  ],
  "assertions": [
    {
      "id": "convey_role",
      "title": "convey the unordered list role",
      "rationale": "A screen reader user needs to know that content is contained in an unordered list.",
      "examples": [
        "Typically, the word \"list\" is announced when entering the list, then the word \"bullet\" is announced when entering a list item. Together, these two pieces of information convey the unordered list role."
      ],
      "css_target": "ol",
      "preconditions": [],
      "operation_modes": [
        "sr/reading",
        "sr/interaction"
      ]
    },
    {
      "id": "convey_boundaries",
      "title": "convey the list boundaries",
      "rationale": "A screen reader user needs to know when they enter and exit a list.",
      "examples": [
        "In reading mode, there might be a stop for both the start end end of the list. When entering the list, something like \"list of x items\" is announced. When leaving the list, something like \"end of list\" is announced.",
        "In reading mode, there might not be a stop for the start or end of the list. In this case, the screen reader might announce the first item as something like 1 of x, and the last item as x of x, or otherwise announce the boundaries when entering or exiting the list.",
        "In interaction mode, there will not be a stop for the start or end of the list. In this case, the screen reader might announce the first item as something like \"list of x items\", and the last item as \"x of x\", or \"end of list\", or otherwise announce the the boundaries when entering or exiting the list."
      ],
      "css_target": "ol",
      "operation_modes": [
        "sr/reading",
        "sr/interaction"
      ]
    },
    {
      "id": "convey_setsize",
      "title": "convey the number of items in the list",
      "rationale": "A screen reader user needs know how many items are in the list.",
      "css_target": "ol",
      "operation_modes": [
        "sr/reading",
        "sr/interaction"
      ]
    },
    {
      "id": "convey_nesting_level",
      "rationale": "A screen reader user might find it helpful to know what nesting level they are at.",
      "examples": [
        "A screen reader might announce something like \"nesting level x\" when entering a nested list"
      ],
      "css_target": "ul ul"
    }
  ],
  "date_updated": "2019-09-15"
}
