{
  "id": "aria-flowto_attribute",
  "title": "aria-flowto attribute",
  "type": "attribute",
  "description": "Identifies the next element (or elements) in an alternate reading order of content which, at the user's discretion, allows assistive technology to override the general default of reading in document source order.",
  "references": [
    {
      "title": "ARIA spec for aria-flowto",
      "url": "https://www.w3.org/TR/wai-aria-1.1/#aria-flowto"
    }
  ],
  "assertions": [
    {
      "id": "convey_presence_to",
      "title": "convey the presence of the flowto attribute",
      "rationale": "A user needs to understand that the current element flows to another element so that they can invoke the functionality.",
      "strength": {
        "sr": "MUST",
        "vc": "NA"
      },
      "css_target": "*[aria-flowto]",
      "operation_modes": [
        "sr/reading"
      ]
    },
    {
      "id": "convey_presence_from",
      "title": "convey that another element flows to the current element",
      "rationale": "The reading order goes both directions, and a user needs to be aware of the alternate reading order so that they can invoke the functionality. ",
      "strength": {
        "sr": "MUST",
        "vc": "NA"
      },
      "css_target": "*",
      "operation_modes": [
        "sr/reading"
      ]
    },
    {
      "id": "allow_navigation_to",
      "title": "let a user navigate to referenced element(s). If the there are multiple targets, the user MUST be able to choose which one to navigate to.",
      "rationale": "A user needs to be able to follow the alternate reading order.",
      "strength": {
        "sr": "MUST",
        "vc": "NA"
      },
      "css_target": "*[aria-flowto]",
      "operation_modes": [
        "sr/reading"
      ]
    },
    {
      "id": "allow_navigation_from",
      "title": "let a user navigate to elements that target the current element. If this functionality is provided and the there are multiple targeting elements, the user must be able to choose which one to navigate to.",
      "rationale": "The reading order goes both directions, and a user needs to be able to travel backwards through their chosen reading order.",
      "strength": {
        "sr": "MUST",
        "vc": "NA"
      },
      "css_target": "*",
      "operation_modes": [
        "sr/reading"
      ]
    }
  ],
  "date_updated": "2019-01-08"
}
